{
  "home": "Home",
  "about": "About",
  "services": "Services",
  "contact": "Contact",
  "name": "I'm Beyza Yalçınkaya,",
  "role": "a software developer based in Turkey.",
  "aboutTitle": "About Me",
  "aboutPara1": "My passion for software development stems from my engineering background. I specialize in web and mobile technologies, with a particular focus on frontend development. I stay up-to-date with the latest trends and prioritize both user experience and design aesthetics in every line of code I write.",
  "aboutPara2": "I approach each project not only with technical expertise but also with motivation and a design-oriented mindset. When developing products using React and modern web tools, I pay attention to details and aim to deliver real value to the end user.",
  "html_css": "HTML & CSS",
  "javascript": "JAVASCRIPT",
  "react_js": "REACT JS",
  "react_native": "REACT NATIVE",
  "myServices": "My Services",
  "service1_name": "Web Development",
  "service1_desc": "I design and develop modern, performance-focused websites using React, HTML, CSS, and JavaScript. I deliver fast, mobile-friendly solutions with a strong focus on user experience.",
  "service2_name": "Mobile Development",
  "service2_desc": "I create user-friendly mobile applications for Android and iOS using React Native, optimized for both performance and ease of use.",
  "service3_name": "Full Stack Development",
  "service3_desc": "I build complete end-to-end web applications using both frontend and backend technologies, prioritizing security, performance, and scalability at every stage.",
  "service4_name": "UI/UX Design",
  "service4_desc": "I design visually appealing and functional user interfaces for web and mobile projects, enhancing user engagement and overall satisfaction.",
  "service5_name": "Backend Development",
  "service5_desc": "I develop robust backend systems, APIs, and databases to ensure secure and efficient operation of applications. I optimize data flow and maintain the sustainability of projects.",
  "service6_name": "Performance Optimization",
  "service6_desc": "I optimize web and mobile applications for speed, responsiveness, and scalability, maximizing user experience. I ensure applications run smoothly and efficiently across all devices.",
  "getInTouch": "Get In Touch",
  "nameLabel": "Your Name",
  "namePlaceholder": "Enter Your Name",
  "emailLabel": "Email Address",
  "emailPlaceholder": "Enter Your Email",
  "messageLabel": "Your Message",
  "messagePlaceholder": "Enter your message here",
  "submitButton": "Submit",
  "copyright": "All rights reserved."
}