{
  "home": "Ana Sayfa",
  "about": "Hakkımda",
  "services": "Hizmetler",
  "contact": "İletişim",
  "name": "Ben Beyza Yalçınkaya,",
  "role": "Türkiye'de yaşayan bir yazılım geliştiricisiyim.",
  "aboutTitle": "Hakkımda",
  "aboutPara1": "Yazılım geliştirme ilgim, mühendislik eğitimimden geliyor. Web ve mobil teknolojilerde uzmanım ve özellikle frontend geliştirmeye odaklanıyorum. Güncel trendleri takip ederek, yazdığım her kodda kullanıcı deneyimi ve tasarım estetiğine öncelik veriyorum.",
  "aboutPara2": "Her projeye yalnızca teknik bilgiyle değil, aynı zamanda motivasyon ve tasarım odaklı bir yaklaşım ile başlarım. React ve modern web araçlarını kullanarak geliştirilen ürünlerde, detaylara önem vererek son kullanıcıya gerçek değer sunmayı hedeflerim.",
  "html_css": "HTML & CSS",
  "javascript": "JAVASCRIPT",
  "react_js": "REACT JS",
  "react_native": "REACT NATIVE",
  "myServices": "Hizmetlerim",
  "service1_name": "Web Geliştirme",
  "service1_desc": "React, HTML, CSS ve JavaScript kullanarak modern ve performans odaklı web siteleri tasarlıyorum. Kullanıcı deneyimini önceliklendiren, hızlı ve mobil uyumlu çözümler sunuyorum.",
  "service2_name": "Mobil Geliştirme",
  "service2_desc": "Android ve iOS için React Native kullanarak performans ve kullanım kolaylığı açısından optimize edilmiş kullanıcı dostu mobil uygulamalar oluşturuyorum.",
  "service3_name": "Full Stack Geliştirme",
  "service3_desc": "Hem frontend hem backend teknolojilerini kullanarak eksiksiz, uçtan uca web uygulamaları geliştiriyorum. Projelerin her aşamasında güvenlik, performans ve ölçeklenebilirliği ön planda tutuyorum.",
  "service4_name": "UI/UX Tasarım",
  "service4_desc": "Web ve mobil projelerde estetik ve fonksiyonelliği bir araya getirerek kullanıcı dostu ve etkileyici arayüzler tasarlıyorum. Tasarımlar ile kullanıcı etkileşimini artırmayı ve kullanıcıyı memnun etmeyi hedefliyorum.",
  "service5_name": "Backend Geliştirme",
  "service5_desc": "Uygulamaların güvenli ve verimli çalışması için sağlam backend sistemleri, API’ler ve veritabanları geliştiriyorum. Veri akışını optimize ediyor ve projelerin sürdürülebilirliğini sağlıyorum.",
  "service6_name": "Performans Optimizasyonu",
  "service6_desc": "Web ve mobil uygulamaların hızını, yanıt süresini ve ölçeklenebilirliğini optimize ederek kullanıcı deneyimini üst düzeye çıkarıyorum. Uygulamaların her cihazda hızlı ve sorunsuz çalışmasını garanti ediyorum.",
  "getInTouch": "İletişime Geçin",
  "nameLabel": "Adınız",
  "namePlaceholder": "Adınızı girin",
  "emailLabel": "E-posta Adresiniz",
  "emailPlaceholder": "E-posta adresinizi girin",
  "messageLabel": "Mesajınızı Yazın",
  "messagePlaceholder": "Mesajınızı buraya girin",
  "submitButton": "Gönder",
  "copyright": "Tüm hakları saklıdır."
}